src/cf/InformationRegisters/АрхивСообщенийОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АрхивСообщенийОбменов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПринятогоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлБольше100Мб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Comment>АПК:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиАрхиваСообщенийОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАрхиваСообщенийОбменов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоФайлов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьНаДиске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолныйПуть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СжиматьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Comment>АПК:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РезультатыОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВозникновения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропущена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияОтборовНезависимогоРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипПроблемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроблемОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроблемныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АрхивСообщенийОбменов/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоместитьСообщениеВАрхив(УзелИнформационнойБазы, ПутьКИсходномуФайлу) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		Возврат;
	КонецЕсли;
	
	ПланыОбменаБСП = ОбменДаннымиПовтИсп.ПланыОбменаБСП();
	Если ПланыОбменаБСП.Найти(УзелИнформационнойБазы.Метаданные().Имя) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиАрхиваСообщенийОбменов.ПолучитьНастройки(УзелИнформационнойБазы);
	
	Если Настройки = Неопределено Или Настройки.КоличествоФайлов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ПоместитьВАрхив(УзелИнформационнойБазы, ПутьКИсходномуФайлу, Настройки);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииПомещениеСообщенияВАрхив(),
			УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
		
		ТекстПричины = НСтр("ru ='Файл не был помещен в архив.'") + Символы.ПС + СообщениеОбОшибке;
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
		ПараметрыЗаписи.Вставить("Причина", ТекстПричины);
		ПараметрыЗаписи.Вставить("ТипПроблемы", Перечисления.ТипыПроблемОбменаДанными.СообщениеОбменаНеПомещеноВАрхив);
		РегистрыСведений.РезультатыОбменаДанными.ДобавитьЗаписьОРезультатахОбмена(ПараметрыЗаписи);
		
	КонецПопытки;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоместитьВАрхив(УзелИнформационнойБазы, ПутьКИсходномуФайлу, Настройки)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.АрхивСообщенийОбменов");
	ЭлементБлокировки.УстановитьЗначение("УзелИнформационнойБазы", УзелИнформационнойБазы);
	Блокировка.Заблокировать();
	
	Набор = РегистрыСведений.АрхивСообщенийОбменов.СоздатьНаборЗаписей();
	Набор.Отбор.УзелИнформационнойБазы.Установить(УзелИнформационнойБазы);
	Набор.Прочитать();
	
	КоличествоЗаписей = Набор.Количество();
	Для Сч = 1 По КоличествоЗаписей Цикл
		
		Индекс = КоличествоЗаписей - Сч;
		Запись = Набор[Индекс];
		Если Запись.ФайлБольше100Мб Тогда
			Набор.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = 1 По Набор.Количество() - Настройки.КоличествоФайлов + 1 Цикл
		
		Запись = Набор.Получить(0);
		
		Если Запись.ПолноеИмяФайла <> "" Тогда
			УдалитьФайлы(Запись.ПолноеИмяФайла);
		КонецЕсли;
			
		Набор.Удалить(0);
		
	КонецЦикла;
		
	Если СтрЗаканчиваетсяНа(НРег(ПутьКИсходномуФайлу), "zip") Тогда
		РасширениеФайла = "zip";
	Иначе
		РасширениеФайла = "xml";
	КонецЕсли;
	
	ХешСуммаСообщенияОбмена = "";
	
	Если РасширениеФайла = "zip" Тогда
		ИмяВременногоКаталога = ПолучитьИмяВременногоФайла("");
		
		Если ОбменДаннымиСервер.РаспаковатьZipФайл(ПутьКИсходномуФайлу, ИмяВременногоКаталога) Тогда
			СписокРаспакованныхФайлов = НайтиФайлы(ИмяВременногоКаталога, ПолучитьМаскуВсеФайлы(), Истина);
			
			Если СписокРаспакованныхФайлов.Количество() Тогда
				ДвоичныеДанныеСообщенияОбмена = Новый ДвоичныеДанные(СписокРаспакованныхФайлов[0].ПолноеИмя);
				ХешСуммаСообщенияОбмена = ОбменДаннымиСервер.ХешСуммаСообщениеОбмена(ДвоичныеДанныеСообщенияОбмена);
			КонецЕсли;
		КонецЕсли; 
		
		УдалитьФайлы(ИмяВременногоКаталога);
	Иначе
		ДвоичныеДанныеСообщенияОбмена = Новый ДвоичныеДанные(ПутьКИсходномуФайлу);
		ХешСуммаСообщенияОбмена = ОбменДаннымиСервер.ХешСуммаСообщениеОбмена(ДвоичныеДанныеСообщенияОбмена);
	КонецЕсли;
	
	УдалитьФайлПослеПомещения = Ложь;
	Если Настройки.СжиматьФайлы И РасширениеФайла <> "zip" Тогда
		
		УдалитьФайлПослеПомещения = Истина;
		РасширениеФайла = "zip";
		ИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
		
		ОбменДаннымиСервер.ЗапаковатьВZipФайл(ИмяФайла, ПутьКИсходномуФайлу);
		
	Иначе
		
		ИмяФайла = ПутьКИсходномуФайлу;
		
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	РазмерФайла = Файл.Размер() / (1024 * 1024); 
	
	Шаблон = "%1_%2_%3";
	ИмяФайлаВАрхиве = СтрШаблон(Шаблон, 
		УзелИнформационнойБазы.Код,
		УзелИнформационнойБазы.НомерПринятого,
		Строка(Новый УникальныйИдентификатор));
	
	НовыйАрхив = Набор.Добавить();
	НовыйАрхив.УзелИнформационнойБазы = УзелИнформационнойБазы;
	НовыйАрхив.Период = ТекущаяДатаСеанса();
	НовыйАрхив.НомерПринятогоСообщения = УзелИнформационнойБазы.НомерПринятого;
	НовыйАрхив.РазмерФайла = РазмерФайла;
	НовыйАрхив.ИмяФайла = ИмяФайлаВАрхиве;
	НовыйАрхив.РасширениеФайла = РасширениеФайла;
	НовыйАрхив.ХешСуммаФайла = ХешСуммаСообщенияОбмена;
	
	Если Настройки.ХранитьНаДиске Тогда
		
		Шаблон = "%1%2.%3";
		
		ИмяПапки = Настройки.ПолныйПуть;
				
		ПолноеИмяФайлаВПапке = СтроковыеФункции.ФорматированнаяСтрока(Шаблон,
			ИмяПапки,
			ИмяФайлаВАрхиве,
			РасширениеФайла);
			
		КопироватьФайл(ИмяФайла, ПолноеИмяФайлаВПапке);
		НовыйАрхив.ПолноеИмяФайла = ПолноеИмяФайлаВПапке;
			
	Иначе
				
		Если ОбщегоНазначения.РазделениеВключено() И РазмерФайла > 100 Тогда
			
			НовыйАрхив.ФайлБольше100Мб = Истина;
			
			Причина = НСтр("ru = 'Сообщение обмена больше 100 Мб. Файл не был помещен в архив.'");
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
			ПараметрыЗаписи.Вставить("Причина", Причина);
			ПараметрыЗаписи.Вставить("ТипПроблемы", Перечисления.ТипыПроблемОбменаДанными.СообщениеОбменаНеПомещеноВАрхив);
			РегистрыСведений.РезультатыОбменаДанными.ДобавитьЗаписьОРезультатахОбмена(ПараметрыЗаписи);
	
		Иначе
			
			НовыйАрхив.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайла));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УдалитьФайлПослеПомещения Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
    
	Набор.Записать();
	
КонецПроцедуры

Функция СобытиеЖурналаРегистрацииПомещениеСообщенияВАрхив()
	
	Возврат НСтр("ru = 'Обмен данными.Помещение сообщения в архив'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти

#КонецЕсли
